{"doc_id": "sample.pdf", "source_type": "pdf", "title": "sample.pdf", "body": "MARKETING | RESEARCH ARTICLE\nConsumer technology brands and the source of \ntheir performance\nJorge Vera-Martínez1*\nAbstract:  Over the past 20 years, consumer technology products have significantly \nimpacted consumers’ purchasing patterns and behaviors. The companies catering \nto this market have demonstrated unprecedented innovation and financial perfor­\nmance. Therefore, it is important to understand how consumers process such \nbrands in forming their product preferences. Consumer technology brands comprise \ncertain products—smartphones, tablets, smartwatches, music devices, and laptops \n—that fulfill a complex mix of numerous functional and emotional needs, such as \njoy, socialization, group acceptance, and group recognition. This study proposes \na conceptual framework to explain how brand loyalty for such products is built upon \ncertain relevant brand perceptions. In an empirical post hoc study involving 320 \ntechnology product customers, measurements for the constructs involved were \nestablished, and a multi-category approach was adopted wherein respondents \nevaluated Apple, HP, Samsung, and Sony products. A statistical structural model is \npresented wherein the relationships proposed in the hypotheses are tested and \nsupported. It is established that brand perceptions of innovativeness, benefits, and \nidentification are likely to be strong antecedents of brand loyalty. Unlike previous \nJorge Vera-Martínez\nABOUT THE AUTHOR \nJorge Vera-Martínez is a Research Professor in \nthe Tecnológico de Monterrey Business School. \nHe has taught, at graduate and undergraduate \nlevels, subjects such as marketing research, \nbrand management, and multivariate methods \nfor marketing decisions. He has published several \nresearch articles on topics such as consumer \nbehavior, service/product performance, consumer \ninvolvement, perceived value, brand perceptions, \nand marketing strategies. At the EGADE Business \nSchool, he is currently the leader-coordinator of \nthe Research Group (GIEE) on Consumer Behavior \nand Conscious Marketing and a member of the \nfaculty of the Ph.D. Program in Administrative \nSciences. One of the research lines addressed by \nthis research group is “branding and consumer \nperceptions”. In this research line, studies \naddress the effects of brand perceptions on cus­\ntomer behavior. Here, variables such as product/ \nservice performance, perceived value, consumer- \nbrand identification, purchasing patterns, and \nbrand performance are analyzed. Our studies \nemphasize responsible and sustainable use of \nbrands and marketing strategies. \nPUBLIC INTEREST STATEMENT \nConsumer technology companies have experi­\nenced impressive growth. An analysis of these \ncompanies and products reveals that these \nbrands share certain features that enable them \nto be named as consumer technology brands. \nThese companies tend to implement a brand \narchitecture strategy wherein they combine the \nuse of a parent brand with sub-brands. These \ntypes of consumer technology brands offer pro­\nducts (laptops, tablets, smartphones, music \ndevices, and gaming devices) that aim to fulfill \na complex set of needs involving emotional \naspects such as membership, recognition, and \npleasure. Brands that share some of these char­\nacteristics are Apple, HP, Samsung, Sony, LG, \nBose, Panasonic, and Logitech. This study pro­\nposes a framework to explain how brand loyalty \nfor such products is built upon certain brand \nperceptions. When perceived innovativeness, \nbenefits, and identification arise, consumers tend \nto manifest a high level of emotional commit­\nment to these brands, thus reducing the prob­\nability of switching to another brand.\nVera-Martínez, Cogent Business & Management (2021), 8: 1969632\nhttps://doi.org/10.1080/23311975.2021.1969632\nPage 1 of 17\nReceived: 24 May 2021 \nAccepted: 15 August 2021\n*Corresponding author: Jorge Vera- \nMartínez, Tecnológico De Monterrey, \nEgade Business School, Calle Del \nPuente 222. Colonia Hejidos De \nHuipulco, Delegación Tlalpan. Ciudad \nDe México, México  \nEmail jorge.vera@tec.mx; jorgevera­\nmartinez1@gmail.com\nReviewing editor:  \numair Akram, Guanghua School of \nManagement, Peking University \nGuanghua School of Management, \nCHINA \nAdditional information is available at \nthe end of the article\n© 2021 The Author(s). This open access article is distributed under a Creative Commons \nAttribution (CC-BY) 4.0 license.\nliterature, this study measures perceived benefits at the parent-brand level rather \nthan at that of the product–category.\nSubjects: Consumer Psychology; Marketing Research; Brand Management; Consumer \nBehaviour; Marketing Management; Relationship Marketing  \nKeywords: brand innovativeness; perceived benefits; identification with the brand; \naffective loyalty; purchase intentions; behavioral loyalty; technology brands\n1. Introduction\nOver the past couple of decades, consumer technology companies have experienced impressive \ngrowth and financial performance. For example, in the United States, information technology \nservices and online services are currently among the most profitable industries, followed by \ntechnology services and electronic technology products (Chen, 2015a, 2015b). Existing data indi­\ncate that Apple Inc. and Samsung Electronics are among the world’s five most profitable compa­\nnies (McIntyre & Frohlich, 2015). This study considers Apple, HP, Samsung and Sony to be \nprototypical examples of what is termed “technology brands” herein. An analysis of these com­\npanies and their products reveals that parent brands are likely to share certain features that \nenable them to be classified as technology brands. Further, two defining features are considered. \nFirst, to differentiate their products and establish their target market, these companies tend to \nimplement a brand architecture strategy wherein they combine the use of a parent brand with \na sub-brand (e.g., Apple iPhone, Samsung Galaxy, HP Pavilion, and Sony Walkman). Under this \nconfiguration, the parent brand is the one related to the firm as a whole, while the sub-brand is \nrelated to a particular product–category or line in the firm’s portfolio (Aaker & Joachimsthaler, \n2000). The second defining feature of these firms is observed to be a generic differentiation \nstrategy. Under such a strategy, a firm seeks to offer high-quality products at a corresponding \nprice while simultaneously trying to maintain a high level of product and line diversification to \nmanage risks (Porter, 1980, p. 56). Such brands are likely to implement strategies targeting high- \nend markets and become world-renowned. Some of their sub-brands are likely to become famous \nas well (e.g., PlayStation, Envy, Galaxy, and iPad). A considerable portion of their business is \nfocused on the final consumer product categories, with electronics being their core business. \nThus, these brands tend to have salient positions in the Gartner's Digital IQ Index (Consumer \nElectronics, 2018) and other rankings of consumer electronics companies. Other brands that tend \nto share some of these characteristics are LG, Lenovo, Huawei, Bose, GoPro, Dell, Panasonic, and \nLogitech.\nThese types of consumer technology brands offer products (i.e., laptops, tablets, smartphones, \nmusic devices, and gaming devices) that are aimed at fulfilling a complex set of superior needs \ninvolving emotional aspects such as membership, recognition, and pleasure as well as the obvious \nfunctional benefits related to aspects such as productivity, communications, organization, and \ntransactions. We believe that this combination of needs fulfillment implies a unique set of brand \nloyalty drivers that make technology brands quite different from others. Technology products are \ncharacterized by the wide range of needs to which they attend and by their intense rate of \ninnovation, suggesting that branding strategies may be of greater importance for technology \nproducts than they are for packaged goods (Mohr et al., 2010, p. 408; Morris, 1996; Truong et al., \n2017; Ward et al., 1999). A brand that has positive quality associations offers cues that enable the \nconsumer to predict the quality of a product (Van Osselaer & Alba, 2000). Therefore, the success of \nthis kind of brand appears more probable when a good fit exists between a brand’s cognitive \nassociations and a product’s features; customers tend to respond favorably to a well-known brand \nwhen a new product involves complex technological features (Guo et al., 2018; Völckner & Sattler, \n2006). Apparently, brands with such a fit help reduce the perceived risk of attempting some­\nthing new.\nVera-Martínez, Cogent Business & Management (2021), 8: 1969632                                                                                                                                  \nhttps://doi.org/10.1080/23311975.2021.1969632\nPage 2 of 17\nEvidence indicates that despite the profound differences between consumers who are early \nadopters and those who are late adopters, both tend to prefer well-known brands when new high- \ntechnology products or products with innovative technological features (such as smartphones and \nlaptops) are launched (Truong et al., 2017).\nThis study offers a conceptual framework supported by certain hypotheses that attempt to \nexplain the development of brand loyalty and the market performance of technology brands. \nThis framework is based on the relationships between certain perceptual variables that we believe \nto be particularly relevant. This conceptual framework, described below, is illustrated in Figure 1. In \nthe following sections, we present the conceptual framework, hypotheses, methodology for testing \nthese claims, results, and discussion.\n2. Conceptual framework\nThe product innovativeness of a firm has been defined as the degree of intensity with which it \ninnovates in the market and the extent to which its products exhibit novel features (Story et al., \n2015). Perceived innovativeness of technology brands is closely related to the tendency to add new \nfeatures to products that are constantly being relaunched. It appears to be common for flagship \nproducts to be strategically employed to emphasize and engender the innovative nature and image of \nthese kinds of brands as a way of promoting their lines of product categories (Hubert et al., 2017).\nInnovative brands, such as the technology brands referenced in this study, tend to offer a large \nrange of strategic benefits. For example, brand attitude has been shown to yield greater advertising \neffectiveness when innovative brands come into play; consumers seemingly tend to have a positive \nresponse to these kinds of brands when evaluating advertising efforts (Barone & Jewell, 2014). \nMoreover, it appears that innovative brands (with which consumers tend to be more forgiving) allow \na higher level of advertising flexibility, such that advertisements that are backed up by these types of \nbrands can effectively use a wider range of atypical advertising tactics in contrast with non- \ninnovative brands (Barone & Jewell, 2014). Thus, Shams et al. (2015) propose “consumer perceived \nbrand innovativeness” as a brand-level construct in contrast with previous approaches that treat \nperceived innovativeness exclusively at the product or firm level. After a thorough analysis, they \ndescrib it as a subjective evaluation of a brand related to the extent to which a brand is capable of \noffering novel, creative, attractive, and useful solutions to satisfy consumer needs.\nFigure 1. Conceptual \nframework.\nVera-Martínez, Cogent Business & Management (2021), 8: 1969632                                                                                                                                  \nhttps://doi.org/10.1080/23311975.2021.1969632                                                                                                                                                       \nPage 3 of 17\nPrevious studies have suggested that perceived brand innovativeness is an antecedent of \nexcitement about a brand, customer satisfaction and purchase intentions (Shams et al., 2015). It \nhas been shown that there is an attractiveness associated with new and useful ways of addressing \nconsumer needs, such that perceived brand innovativeness is likely to be a direct antecedent of \nconsumer commitment to a brand (Eisingerich & Rubera, 2010). For a complex technological \nproduct, such as a car, perceived brand innovativeness can generate an increase in the level of \nconsumer involvement with the product by attracting the customer’s attention to the brand \n(Henard & Dacin, 2010). This attention can thus be seen as related to excitement about the \nproduct and the positive perception of it, encouraged by that particular brand’s perceived innova­\ntiveness. Therefore, we will retain the following hypothesis: \nH1: With technology brands, perceived innovativeness has a direct effect on perceived consumer \nbenefits (perceived performance).\nCustomer-perceived benefits are understood herein as the extent to which the perceived \nperformance of the attributes of the products of a certain brand meet the customers’ needs and \ndesires from their perspective. Customers appear to have a stronger positive attitude toward \na brand when they believe that it has many favorable characteristics (Bandyopadhyay & Martell, \n2007). For airline brands, evidence shows that memorable experiences and social benefits provided \nby the brand to the customer are likely to produce positive feelings toward the brand that can \nstimulate the formation of brand identification (So et al., 2017). Other benefits such as brand \nprestige and distinctiveness can be positive antecedents of the level of self-identification that \na customer can build with a brand (So et al., 2017). Apparently, when consumers perceive that \nproducts of a particular brand can consistently meet their needs and make them feel that they \nhave benefited from it, beliefs about that brand being closer to their scheme of needs can be \ntriggered. These beliefs may thus promote feelings of ownership of the brand and emotional \nattachment to it when the gap between what the consumer needs and the level to which the \nbrand achieves those needs can be reduced. Consequently, we consider the following hypothesis: \nH2: With technology brands, perceived benefits have a direct effect on brand identification.\nIdentification with a brand, based on social identity theory (e.g., Stets & Burke, 2000), can be \nunderstood as an overlap, congruency, or fit between the consumers’ self-concept (i.e., self- \nidentity) and their perception of the brand’s identity or image (Elbedweihy et al., 2016; So et al., \n2017). This level of congruity can have a direct, sequential effect on different components of the \nbrand loyalty construct by making the brand more appealing to the consumer (Nikhashemi & \nValaei, 2018). Evidence indicates that consumer–brand identification, compared with other possi­\nble antecedents, can be a powerful explanatory variable for brand loyalty in different product \ncategories, including consumer technology products such as laptops (Vera & Trujillo, 2017) and cell \nphones (Kim et al., 2001). Thus, the level of attractiveness of a brand and the level of identification \n(congruity) with that brand tend to be two closely related variables (Elbedweihy et al., 2016; So \net al., 2017). Because of a high identification with a certain brand, consumers tend to manifest \na high level of emotional commitment to that brand, thus reducing the probability of switching to \nanother brand. For example, in a study about two technology product categories—mobile phones \nand televisions—it was found that consumers who closely identify with a preferred brand were not \nonly loyal to the brand but also had a tendency to ignore, suppress, avoid, and withstand adverse \ninformation about it to which they were exposed (Elbedweihy et al., 2016). Additionally, measure­\nments of the degree of consumer identification with a brand are indicative of brand attachment; \nthus, brand attachment is considered to be the strength of the emotional and cognitive bonding of \na consumer to a brand (Park et al., 2010). For instance, in a study on smartphone users \n(Ghorbanzadeh et al., 2020), sentiments of attachment to a brand resulted in a powerful ante­\ncedent of affective brand loyalty (the level of emotional commitment to the brand). Hence, \nevidence suggests that the perceived congruence between self-image and brand image \nVera-Martínez, Cogent Business & Management (2021), 8: 1969632                                                                                                                                  \nhttps://doi.org/10.1080/23311975.2021.1969632\nPage 4 of 17\n(identification) encompasses a powerful emotional connection of the consumer with a brand. \nFurthermore, it has been proposed that smartphone brands have a unique identity for the con­\nsumer because of the level of personalization that these gadgets can have (e.g., ring tones, \nscreensavers, backgrounds, and apps). Apparently, this level of customization tends to represent \na group of attributes that is very important for customers of these types of products. Thus, a higher \nlevel of customization (an increase in perceived benefits) can enable a higher level of identification \nwith the brand and therefore foster brand loyalty (Yeh et al., 2016). If smartphone brands are \ncontained in what we refer to as technology brands, it would be sound to believe that they can \nshare some of the characteristics of smartphone brands in terms of identification. In a study \nwherein respondents were asked to evaluate their favorite brands across several product cate­\ngories, one being electronics, consumer–brand identification was also found to be a relevant factor \nin stimulating affectivity toward the brand (Tuškej et al., 2013). Therefore, in the present con­\nceptual framework we include the following hypothesis: \nH3: With technology brands, identification with the brand has a direct effect on affective loyalty.\nThe following aspects of this conceptual framework are based on the theory of brand loyalty \nformation through a series of stages or phases of loyalty proposed by Oliver (1999), which is in turn \nbased on the theory of attitude components. According to Oliver (1999), cognitive (knowledge) \naspects of a brand related to consumer consciousness can have a positive effect on the affectivity \nthat a consumer may feel for a brand. If the information in the consumer’s mind is favorable, then \npleasant feelings toward the object (in this case the brand) may be triggered. Then, the favorable \naffective effect, along with the favorable cognitive content, tends to activate behavioral intentions \n(intention to purchase or conative loyalty) in the consumer. Finally, as an outcome of the previous \nmechanisms, the emergence of an actual repeated purchasing behavior toward the brand (beha­\nvioral loyalty) is probable. Therefore, the formation of cognitive components must be achieved \nbefore affective ones can be reached.\nIn the current conceptual framework (in an attempt to explain the formation of loyalty to \nconsumer technology brands), we believe that the constructs outlined in the above-mentioned \nhypotheses (perceived innovativeness, perceived benefits, and identification with the brand) play \nthe role of the cognitive components that must precede the formation of affective loyalty. It has \nbeen empirically confirmed that when cognitive and affective components of the perception of \na technology product (in this case, the smartphone) correlate, these components serve as ante­\ncedents of consumer behavioral intentions (Lin et al., 2015). Therefore, we assume the following \nhypothesis: \nH4: With technology brands, affective loyalty has a direct effect on behavioral intentions (cognitive \nloyalty).\nAlthough the literature in general has revealed certain inconsistencies when establishing \nconstructs to predict behavioral loyalty, the variable of behavioral intentions appears to be a highly \nconsistent antecedent of behavioral loyalty (Bandyopadhyay & Martell, 2007). In the review of the \nbrand loyalty literature, particularly the review of research articles on the measurement of \nbehavioral intentions, it is noticeable that the latter concept is referenced under various names. \nFor example, it can be found under terms such as purchase intentions, behavioral intention, \nintentional loyalty, conative loyalty, and attitudinal loyalty. Additionally, behavioral loyalty can \nbe found in the literature under different terms such as repeat purchase pattern, action loyalty, \nand others. Some authors concur that true brand loyalty occurs when these two forms of loyalty \ncan be observed together: a favorable disposition (affectivity) to a brand with a favorable pattern \nof repeat purchasing behavior (Bandyopadhyay & Martell, 2007; Park et al., 2010). According to \nOliver (1999) (partially based on Kuhl & Beckmann, 1985, p. 90), the mechanism by which intention \ngives way to observable actions corresponds to a sequence that can be called the “action–control \nVera-Martínez, Cogent Business & Management (2021), 8: 1969632                                                                                                                                  \nhttps://doi.org/10.1080/23311975.2021.1969632                                                                                                                                                       \nPage 5 of 17\nparadigm.” In this process, the intentional state can breed a cognitive “prepared-to-action” con­\ndition. Additionally, in this sequence, a desire to overcome obstacles that may discourage purchas­\ning behavior also tends to emerge. If these two conditions occur, they may generate a strong \nmotivation to purchase the product and, thereafter, if repeatedly reinforced, even to incentivize \nrepurchase. As noted above, a study with users of a consumer technological product (the smart­\nphone) confirmed the cascading effect of causalities between loyalty phases, thus suggesting that \nthis theory can explain how brand loyalty is built up for technological products in general (Lin et al., \n2015). A study involving users of a portable electronic device (the iPod) presents analogous results \n(Park et al., 2010). Therefore, we consider the following hypothesis: \nH5: With technology brands, behavioral intentions have a direct effect on behavioral loyalty.\n2.1. Expected indirect effects\nThese previously proposed hypotheses are related to the expected direct effects among the \nconstructs proposed in the model to explain loyalty toward technology brands. However, as \nadditional hypothesized elements in this conceptual model, indirect relationships appear to exist \namong these constructs. For example, as innovativeness serves as a signal to encourage consumer \nbehavior, there is evidence suggesting that there are indirect effects (or some sort of relationship) \nof perceived innovativeness on components of brand loyalty (Anisimova, 2007; Eisingerich & \nRubera, 2010; Fazal-e-Hasan et al., 2019; Henard & Dacin, 2010; Pappu & Quester, 2016; Shams \net al., 2015, 2017). It has also been suggested that the perceived congruity between brand image/ \npersonality and the consumer’s self-perception (identification with the brand) can have an indirect \neffect on the different phases of loyalty (Eisingerich & Rubera, 2010; Guido & Peluso, 2015; Kang \net al., 2015; Nikhashemi & Valaei, 2018). Therefore, the effects of perceived innovativeness are \nexpected to cause identification with the brand and aspects of loyalty. Accordingly, there are \nexpected indirect effects of perceived benefits and brand identification on behavioral intentions \nand behavioral loyalty. Figure 3 illustrates a complete pattern of these indirect effects.\nOverall, superior levels of product innovativeness tend to correspond to higher levels of financial \nperformance of new products in firms with a high market orientation strategy (the type of strategy \ncommonly followed by consumer technology brands), despite the high market risk that this \ncombination implies (Story et al., 2015). This relationship could be explained by the bridging effect \nthat brand loyalty can have between innovativeness and business performance, as suggested by \nthe current framework.\n3. Methodology and measurements\nWhat do we mean by “technology brands?” For this study, we selected users of Apple, HP, \nSamsung, or Sony products, or any combination thereof. These brands were chosen because of \nthe following characteristics. They are multiproduct brands at the corporate (parent) level that \nfollow a multiproduct category strategy. These four are parent brands that use sub-brands for \neach of the product categories they offer (e.g., Apple Watch, HP Pavilion, Samsung Galaxy, and \nSony Walkman). The four brands tend to conduct a part of their core business based on a business- \nto-consumer strategy (products are offered to final consumers). They are well-recognized brands \nat the global level. Furthermore, these four brands belong to companies that commonly follow \na generic differentiation strategy that involves high-level differentiation and high-level diversifica­\ntion (differentiation strategy as in Porter, 1980, p. 56), and obviously, they offer electronic tech­\nnological products.\nTo participate, the respondents had to have recently purchased at least one consumer product \nfrom one of the four participant brands (Apple, HP, Samsung and Sony) targeting final consumers: \nsmartphones, tablets, personal computers, music devices, laptops, etc. (industrial products were \nnot considered). The purchased product had to be for their own use (i.e., was not a present for \nsomeone else). They had to be familiar with this brand and its products. In the questionnaire, \nVera-Martínez, Cogent Business & Management (2021), 8: 1969632                                                                                                                                  \nhttps://doi.org/10.1080/23311975.2021.1969632\nPage 6 of 17\nrespondents had to evaluate the particular brand. Participants were final consumers aged between \n23 and 35 years. This age range was selected as it is a common segment for these brands’ \nproducts and because it provides some control over the sample’s variability. The final sample \n(n = 320) is fairly balanced thoughout this age range. The sample is also fairly balanced for gender, \nas 53% of the respondents identified as men and 47% as women. The sample is also equally \ndivided among the four participating brands (25% each).\nWith these subjects, a post hoc design was implemented under which they had to answer \na structured questionnaire comprising items related to the constructs proposed in the conceptual \nframework. The participants were chosen using convenience sampling by randomly approaching \npotential respondents; these were intercepted and asked to participate in the study. The full \nquestionnaire was given once it was confirmed that the participants met the requirements. \nThese encounters occurred on university campuses (the participants were not necessarily stu­\ndents). The questionnaire was pilot tested and corrected twice (n = 20 each) before the final \nversion was distributed.\nPerceived benefits are often assessed recognizing various dimensions of this construct. Common \ndimensions of perceived benefits are cognitive, social, personal, spiritual, and enjoyment benefits \n(e.g., Casidy, 2013; Mimouni-Chaabane & Volle, 2010; Mulyanegara, 2011; Wang et al., 2013). In \nsome studies, perceived benefits are measured directly in terms of the perceived performance of \na specific set of product/service-level attributes (e.g., Loureiro, 2013). Under another approach, \nperceived benefits have been suggested as a construct formed by three dimensions: functional, \nexperiential, and symbolic benefits (e.g., Kang & Shin, 2016; Keller, 1993). All these visions are \nconsistent with a product-level approach regarding specific attributes of a product or service \ncategory.\nFor the current study, as we are dealing with the perception of parent brands (as set forth above) \nwhich include multiple sub/product–category brands (conveying a great number of benefits, needs, \nor attributes), we needed a different perspective. Thus, we adopted a unidimensional overall \nprocedure. Therefore, measurements were designed with which perceived benefits could be \nassessed at a parent brand level. In this fashion, these items are intended to reflect the level at \nwhich the customer perceives benefits without specifying any benefits or attributes in particular. \nHowever, this way of measuring is consistent with previous approaches in that perceived benefits \nmust be related to the fulfillment of needs (in this case, unspecified needs). These items are \npresented in Table 1 along with measurements for the other constructs contemplated in this \nmodel, with references to the related literature. These other measurements were not extracted \nfrom one particular source; rather, they were adapted from various sources or written following \nthe example of previous research. The aim throughout was to remain consistent with previous \nliterature in order to maintain conceptual validity. Questionnaire items were associated with \nattitudinal scales ranging from “totally disagree” to “totally agree.” In the case of brand innova­\ntiveness, perceived benefits and identification with the brand seven-point scales were used. In the \ncase of affective loyalty and intentions, six-point scales were employed. Finally, for behavioral \nloyalty, a five-point scale was utilized. These variations in the scales were used as a way to reduce \ncommon method bias (Podsakoff et al., 2012). Other tactics used with the intention of reducing the \npotential effect of this phenomenon were related to the questionnaire format, such as page \nbreaks, sectioning, visual changes, and resetting instructions (Podsakoff et al., 2012). \nNevertheless, a Harman’s single-factor test was performed. According to this technique, if com­\nmon method bias exists, only one factor should emerge (with 50% or more of explained variance) \nfrom an exploratory factor analysis wherein all of the observed variables (items) for the constructs \nin the model are introduced (Podsakoff et al., 2003). This was not the case; actually, many factors \nemerged.\nThree items for each construct (shown in Table 1) were tested for unidimensionality with \na convergence validity test using factor analysis (principal components) with no rotation. If all \nVera-Martínez, Cogent Business & Management (2021), 8: 1969632                                                                                                                                  \nhttps://doi.org/10.1080/23311975.2021.1969632                                                                                                                                                       \nPage 7 of 17\nitems converged in a single factor with high factor loadings, they were considered unidimensional. \nIn Table 2, the factor loadings and coefficients of the factor analyses are presented. Kaiser–Meyer– \nOlkin (KMO) and Bartlett’s tests and average variance extracted (AVE) coefficients tend to confirm \nthat the factor models are representative of the observed variables (items), thus confirming \nunidimensionality. Table 2 exhibits composite and Cronbach’s alpha coefficients above .8 which \nsupport the items’ high level of reliability (Tavakol & Dennick, 2011).\n4. Results\nThe descriptive statistical results for the observed variables are presented in Table A2. To test the \nconceptual model and hypotheses, a statistical structural model (SEM) was designed using AMOS \nsoftware with a maximum likelihood procedure. In this statistical model, all of the measurement \nweights between latent variables (for each construct) were statistically significant, confirming the \nresults presented in Table 2. Regarding the absolute fit indices, a CMIN/DF coefficient of 3.64 and \na root mean squared error of approximation (RMSEA) coefficient of .09 were obtained. The mini­\nmum discrepancy per degree of freedom (CMIN/DF) values under 5.0 tend to be an indicator of \na good fit between the data and the model (Hooper et al., 2008; Wheaton et al., 1977). RMSEA \ncoefficients below .1 tend to be acceptable (Browne & Cudeck, 1992; Hooper et al., 2008). \nRegarding relative (baseline) fit indices, the following outcomes were obtained: NFI = .90, \nIFI = .93, TLI = .92 and CFI = .93. According to some studies, for this type of fit index, values \nabove .9 tend to be acceptable and indicate a good fit between the observed and the baseline \nmodels (Bentler & Bonett, 1980; Byrne, 2013; Hooper et al., 2008). Using multiple index presenta­\ntion with combined rules of rejection/acceptance is one way to reduce the probability of making \nType I or Type II errors when assessing model fit in structural equation modeling (Hu & Bentler, \n1999).\nTable 1. Measurements\nItems\nAdapted from\nConsumer perceived brand innovation \nThis brand has highly trendy and relevant products. \nIt is a brand with innovative products. \nThis brand is at the forefront of its market.\nFazal-e-Hasan et al., 2019; Henard & Dacin, 2010; \nPappu & Quester, 2016; Shams et al., 2015.\nPerceived benefits of the brand \nProducts with this brand are always highly useful or \nbeneficial. \nWith this brand, I always have products that go with \nmy needs. \nThe products of this brand have always been useful to \nme.\nAuthor’s elaboration.\nIdentification with the brand (self–brand congruity) \nThis brand understands me as to what I need. \nI identify myself with this brand. \nThis brand reflects the things that interest me.\nGuido & Peluso, 2015; Kim et al., 2001; Rather, 2018; \nSo et al., 2017; Tuškej et al., 2013; Vera & Trujillo, \n2017; Wang et al., 2013.\nAffective (attitudinal) loyalty to the brand \nI really like this brand. \nI prefer this brand over others. \nThis brand is one of my favorites.\nBennett & Rundle-Thiele, 2002; Oliver, 1999; Tuškej \net al., 2013; Yoo & Donthu, 2001.\nPurchase intentions (intentional loyalty) \nI will buy this brand again. \nI will recommend this brand. \nI consider this brand first when I buy products of this \ntype.\nKim et al., 2001; Yoo & Donthu, 2001; Zeithaml et al., \n1996; Baumann et al., 2007; Rather, 2018.\nBehavioral loyalty toward the brand \nI usually buy this brand. \nI have bought products of this brand. \nI have always selected this brand.\nOliver, 1999; Olsen, 2002; Martos-Partal & González- \nBenito, 2013; Vera & Trujillo, 2017.\nThe original items in Spanish are presented in Table A1. \nVera-Martínez, Cogent Business & Management (2021), 8: 1969632                                                                                                                                  \nhttps://doi.org/10.1080/23311975.2021.1969632\nPage 8 of 17\nTable 2. Measurement’s convergence validity and reliability coefficients\nConvergence\nReliability\nVariable \n(three items \neach)\nItem’s single- \nfactor loadings\nKMO\nBartlett’s test \np-value\nAVE\nComposite \nreliability\nCronbach’s \nalpha\nPerceived \ninnovation\n.83 \n.89 \n.86\n.75\n.000\n.74\n.90\n.92\nPerceived benefits\n.86 \n.91 \n.87\n.72\n.000\n.77\n.91\n.86\nIdentification with \nthe brand\n.82 \n.91 \n.89\n.67\n.000\n.76\n.91\n.85\nAffective loyalty\n.87 \n.93 \n.92\n.73\n.000\n.82\n.93\n.89\nPurchase \nintentions\n.92 \n.89 \n.90\n.74\n.000\n.82\n.93\n.89\nBehavioral loyalty\n.86 \n.91 \n.88\n.72\n.000\n.78\n.91\n.86\nTable 3. Results\nHypothesis\nRelationship\nStandardized \ncoefficient\np-value\nR2\nDecision\nH1\nInnovativeness\n→\nBenefits\n.85\n≤.001\n.73\nSupported\nH2\nBenefits\n→\nIdentification\n.87\n≤.001\n.75\nSupported\nH3\nIdentification\n→\nAffective\n.84\n≤.001\n.70\nSupported\nH4\nAffective\n→\nIntentions\n.97\n≤.001\n.93\nSupported\nH5\nIntentions\n→\nBehavior\n.35\n≤.001\n.12\nSupported\nFigure 2. Standardized regres­\nsion weights(direct effects).\nAll regression weights are sig­\nnificant at .05. \nVera-Martínez, Cogent Business & Management (2021), 8: 1969632                                                                                                                                  \nhttps://doi.org/10.1080/23311975.2021.1969632                                                                                                                                                       \nPage 9 of 17\nAccording to the information in Table 3 and Figure 2, the data tend to confirm the relationships \nproposed in the five hypotheses. In all cases, significant path coefficients are observed. \nConsiderably high levels of explanation (R-squared coefficients) for dependent variables were \nobtained in the case of the first four hypotheses. Therefore, strong relationships were observed \nfor H1–H4, supporting a considerable part of the theoretical model. However, although significant, \ncoefficients for behavioral loyalty were lower than expected. As Oliver (1999) conjectured, of all of \nthe loyalty phases, behavioral loyalty is expected to be the most difficult to predict and explain. \nThe extant literature on brand loyalty tends to confirm this claim.\nAs presented in Figure 3, the expected indirect relationships between the constructs were \nobtained. To test for statistical significance regarding these indirect effects, a bootstrap confidence \ntest was performed using multi-group analysis in AMOS. All of the relationships proved to be \nsignificant. Generally, strong indirect relationships were observed for the first five latent variables \n(constructs) in the model. Once again, the coefficients for behavioral loyalty were not very \noptimistic.\n5. Discussion\n5.1. Contributions\nFor the sake of parsimony, we have proposed a theoretical model based on current research with \na minimum number of explanatory variables. However, we believe that other variables could be \nrelated to the current approach to technology brands in future research. The possible effects of \nsome of these variables are outlined below. Nevertheless, out of curiosity, we have assessed the \neffect of variables such as customer satisfaction and functional perceived value (including items \nfor these variables in the questionnaire) in this study. According to extant literature, these vari­\nables tend to have a relationship with the kinds of variables presented in the conceptual model; \nhowever, satisfaction and perceived value do not appear to be clearly related in loyalty studies of \nconsumer technological products. We therefore tested the effect of customer satisfaction and \nfunctional perceived value on the statistical model. It appears that these two variables tend to \nFigure 3. Indirect statistically \nsignificant effects.\nNon-significant indirect effects \nover 0.01 were omitted from \nthe figure (two tailed bootstrap \nconfidence). \nVera-Martínez, Cogent Business & Management (2021), 8: 1969632                                                                                                                                  \nhttps://doi.org/10.1080/23311975.2021.1969632\nPage 10 of 17\nhave a redundant role and statistical collinearity with perceived benefits in the model. When we \ntried to add them to the statistical model, rather than perceived benefits, the direct path coeffi­\ncients, indirect coefficients, and the r-squared coefficients all tended to drop. Furthermore, the \nstatistical models showed statistical fit problems with these attempts. Confirmatory evidence of \nthis can be observed in Lin et al.’s (2015) study involving smartphone consumers. This study \ndetermined that satisfaction, although statistically significant, had a marginal relationship with \naffective loyalty and intentional loyalty, with coefficients of .23 and .32, respectively. These \ncoefficients contrast sharply with the results in the current work; moreover, perceived benefits \nhave indirect path coefficients of .72 and .70, respectively, with those same forms of brand loyalty \n(affective loyalty and intentional loyalty). Therefore, it makes more sense (conceptually and \nstatistically) to include perceived benefits in the model and to exclude the other two variables \n(satisfaction and perceived value), at least under the conditions of the present study. Therefore, an \nimportant contribution of this study, aside from the model we have presented, could be the \nproposition and scale (items) used to measure perceived brand benefits at the parent brand \nlevel instead of the traditional measurements for this construct, which operate at a specific \nproduct attribute level, as explained above. This approach to perceived benefits, at an overall \nparent brand level, would be consistent with the complex mix of needs that these brands tend to \naddress.\n5.2. Limitations and future research\nIn the future, new variables could be related to the formation of brand loyalty in the context of \nconsumer technology brands. For example, in a study conducted with some technological pro­\nducts, it was empirically supported that brand anthropomorphism (the level at which a brand is \nperceived to have human characteristics) can be an antecedent of the consumer’s identification \nwith the brand (Guido & Peluso, 2015). Thus, considering that brand identification has been \nproposed as an antecedent of brand loyalty here, if consumers feel that a brand has human \nfeatures, then it should be easier for them to relate to that brand, thus reinforcing a level of self- \ncongruency.\nAnother variable that could enrich the explanation of brand loyalty formation in the current \ncontext of technology brands is word of mouth (WoM). Accordingly, consumer–brand identification \nand affectivity for a brand have been corroborated as antecedents of WoM; the latter has also \nbeen treated as a precursor of behavioral intentions in the context of technological products (Kim \net al., 2001; Tuškej et al., 2013). We believe that WoM and therefore e-WoM could be a relevant \nexplanatory variable as it was noticed during the study that the participants liked to talk about \n(and hear about) the kind of products under the umbrella of these consumer technology brands.\nIn some cases, the level of a consumer’s identification (congruity) with a brand’s image can be an \nantecedent of brand trust; therefore, the latter can be a precursor of brand loyalty (Rather, 2018; So \net al., 2013). Thus, it would be sound to believe that in consumer technological products, the level of \ntrust in a brand can also have an effect on consumer loyalty. As the current type of products tend to \nbe costly, trust in the brand is expected to be effective in reducing the inherent perceived risk.\nAn important limitation of this study is to be found in the way behavioral loyalty was measured. As \nnoted in the methodology, this variable was operationalized as a self-reported behavior. Although \na multi-indicator approach was adopted to increase the measurement validity of this latent variable \nin the statistical model, it appears preferable to measure indicators of behavioral loyalty as directly \nobservable variables. Evidence shows that multi-item measurements outperform single-item mea­\nsurements in terms of validity and reliability (Diamantopoulos et al., 2012). We know that when using \nindirect measurement of actual behavior, there is always the problem of self-image bias. However, \nthere is evidence showing that self-reported behavioral measurements, although controversial \n(Kormos & Gifford, 2014), tend to correlate in many cases with directly observed indicators, showing \nconcurrent validity (e.g., Morisky et al., 2002, 1986).\nVera-Martínez, Cogent Business & Management (2021), 8: 1969632                                                                                                                                  \nhttps://doi.org/10.1080/23311975.2021.1969632                                                                                                                                                       \nPage 11 of 17\n5.3. Practical implications\nAccording to the study results, when managing consumer technological products, perceived \ninnovativeness, perceived benefits, and consumer identification (self-congruency) with those ben­\nefits appear to be key elements to consider when designing marketing and branding strategies \nwith the purpose of increasing consumer affectivity and willingness toward the brand. This aspect \nwould mean that having technologically innovative attributes in a product would not be enough if \nthere were no way to translate those innovative features into specific benefits that make \na customer feel engaged with the brand at a personal, self-congruence level. These remarks are \nnot directed to brands such as Apple, HP, Samsung, or Sony, as they already are implementing \nthese kinds of strategies. These elements (innovativeness, benefits, and personal self-involvement) \nare noticeable in their advertising content. Rather, we are addressing a large number of entrepre­\nneurial endeavors seeking to launch this kind of product (consumer technology products) into the \nmarket, as they may not have the skills and knowledge needed to build up their commercial \nnames as those big brands have done. Another practical implication of the study would be that of \nall the possible new features that could be considered innovative in a technological product, only \nthose features that can be translated to relevant, personal, and self-congruent benefits are likely \nto be features upon which strong brands might be created.\nFurthermore, not only is it important for shaping branding strategies to choose relevant attributes \nthat are translatable to self-image engaging benefits, but it is also important to know how to design \ncommunication content reflecting this essential attribute. This content should show how the novel \nfeatures of the product can improve the fulfillment of the consumer’s specific needs and wants.\nAcknowledgements\nWe appreciate Josué Asmitia, Mauricio Saldaña, Fernando \nRodríguez, Gustavo Carrillo, and Fidel Díaz, who are former \nstudents of the bachelor-marketing program of Tecnológico \nde Monterrey in México City, for their invaluable assistance \nin the fieldwork of this research. We thank Josué Asmitia, in \nparticular, for his leadership in this activity.\nAuthor details\nJorge Vera-Martínez1 \nE-mail: jorge.vera@tec.mx \nORCID ID: http://orcid.org/0000-0002-5090-7829 \n1 Department of Marketing, Tecnológico De Monterrey, \nEgade Business School, Ciudad De México, México. \nDisclosure statement\nThere is no conflict of interest to be reported. There is no \nfinancial interest or benefit arising from the direct appli­\ncations of this research to be reported. There is no finan­\ncial funding to be reported. Data can be shared upon \nexplicit request.\nThis work follows Tecnológico de Monterrey’s Ethics \nCommittee guidelines. Ethical principles of research with \nhuman beings have been considered and adhered to \nthoughout the performance of this study. Proper consent \nwas verified when human subjects were invited to parti­\ncipate. All participants were above legal age of adulthood \naccording to Mexican law.\nFunding\nThe author received no direct funding for this research.\nCitation information \nCite this article as: Consumer technology brands and the \nsource of their performance, Jorge Vera-Martínez, Cogent \nBusiness & Management (2021), 8: 1969632.\nReferences\nAaker, D. A., & Joachimsthaler, E. (2000). The brand rela­\ntionship spectrum: The key to the brand architecture \nchallenge. California Management Review, 42(4), \n8–23. https://doi.org/10.1177/000812560004200401\nAnisimova, T. A. (2007). The effects of corporate brand \nattributes on attitudinal and behavioural consumer \nloyalty. Journal of Consumer Marketing, 24(7), \n395–405. https://doi.org/10.1108/ \n07363760710834816\nBandyopadhyay, S., & Martell, M. (2007). Does attitudinal \nloyalty influence behavioural loyalty? A theoretical \nand empirical study. Journal of Retailing and \nConsumer Services, 14(1), 35–44. https://doi.org/10. \n1016/j.jretconser.2006.03.002\nBarone, M. J., & Jewell, R. D. (2014). How brand innova­\ntiveness creates advertising flexibility. Journal of the \nAcademy of Marketing Science, 42(3), 309–321. \nhttps://doi.org/10.1007/s11747-013-0352-7\nBaumann, C., Burton, S., Elliott, G., & Kehr, H. M. (2007). \nPrediction of attitude and behavioural intentions in \nretail banking. International Journal of Bank \nMarketing, 25(2), 102–116. https://doi.org/10.1108/ \n02652320710728438\nBennett, R., & Rundle-Thiele, S. (2002). A comparison of \nattitudinal loyalty measurement approaches. Journal \nof Brand Management, 9(3), 193–209. https://doi.org/ \n10.1057/palgrave.bm.2540069\nBentler, P. M., & Bonett, D. G. (1980). Significance tests \nand goodness of fit in the analysis of covariance \nstructures. Psychological Bulletin, 88(3), 588–606. \nhttps://doi.org/10.1037/0033-2909.88.3.588\nBrowne, M. W., & Cudeck, R. (1992). Alternative ways of \nassessing model fit. Sociological Methods & Research, \n21(2), 230–258. https://doi.org/10.1177/ \n0049124192021002005\nByrne, B. M. (2013). Structural equation modeling with \nEQS: Basic concepts, applications, and programming. \nPsychology Press. https://doi.org/10.4324/ \n9780203807644\nCasidy, R. (2013). How great thy brand: The impact of \nchurch branding on perceived benefits. \nVera-Martínez, Cogent Business & Management (2021), 8: 1969632                                                                                                                                  \nhttps://doi.org/10.1080/23311975.2021.1969632\nPage 12 of 17\nInternational Journal of Nonprofit and Voluntary \nSector Marketing, 18(3), 231–239. https://doi.org/10. \n1002/nvsm.1467\nChen, L. (2015a). The most profitable industries in 2016. \nForbes. Accessed August, 30, 2020 https://www.for \nbes.com/sites/liyanchen/2015/12/21/the-most- \nprofitable-industries-in-2016/#7adfeaf95716\nChen, L. (2015b). The most profitable industries in 2015. \nForbes. Accessed August, 30, 2020 https://www.for \nbes.com/sites/liyanchen/2015/09/23/the-most- \nprofitable-industries-in-2015/#59c832186b73\nDiamantopoulos, A., Sarstedt, M., Fuchs, C., \nWilczynski, P., & Kaiser, S. (2012). Guidelines for \nchoosing between multi-item and single-item scales \nfor construct measurement: A predictive validity \nperspective. Journal of the Academy of Marketing \nScience, 40(3), 434–449. https://doi.org/10.1007/ \ns11747-011-0300-3\nEisingerich, A. B., & Rubera, G. (2010). Drivers of brand \ncommitment: A cross-national investigation. Journal \nof International Marketing, 18(2), 64–79. https://doi. \norg/10.1509/jimk.18.2.64\nElbedweihy, A. M., Jayawardhena, C., Elsharnouby, M. H., \n& Elsharnouby, T. H. (2016). Customer relationship \nbuilding: The role of brand attractiveness and con­\nsumer–brand identification. Journal of Business \nResearch, 69(8), 2901–2910. https://doi.org/10.1016/ \nj.jbusres.2015.12.059\nFazal-e-Hasan, S. M., Ahmadi, H., Kelly, L., & Lings, I. N. \n(2019). The role of brand innovativeness and custo­\nmer hope in developing online repurchase intentions. \nJournal of Brand Management, 26(2), 85–98. https:// \ndoi.org/10.1057/s41262-018-0122-4\nGhorbanzadeh, D., Rahehagh, A., & Botelho, D. (2020). The \nrole of emotional structures in the relationship \nbetween satisfaction and brand loyalty. Cogent \nPsychology, 7(1), 1–19. https://doi.org/10.1080/ \n23311908.2020.1782098\nGuido, G., & Peluso, A. M. (2015). Brand anthropomorph­\nism: Conceptualization, measurement, and impact \non brand personality and loyalty. Journal of Brand \nManagement, 22(1), 1–19. https://doi.org/10.1057/ \nbm.2014.40\nGuo, Y., Zhu, Y., Barnes, S. J., Bao, Y., Li, X., & Le-Nguyen, K. \n(2018). Understanding cross-product purchase \nintention in an IT brand extension context. \nPsychology & Marketing, 35(6), 392–411. https://doi. \norg/10.1002/mar.21094\nHenard, D. H., & Dacin, P. A. (2010). Reputation for pro­\nduct innovation: Its impact on consumers. Journal of \nProduct Innovation Management, 27(3), 321–335. \nhttps://doi.org/10.1111/j.1540-5885.2010.00719.x\nHooper, D., Coughlan, J., & Mullen, M. R. (2008). Structural \nequation modelling: Guidelines for determining \nmodel fit. Electronic Journal of Business Research \nMethods, 6(1), 53–60.\nHu, L. T., & Bentler, P. M. (1999). Cutoff criteria for fit \nindexes in covariance structure analysis: \nConventional criteria versus new alternatives. \nStructural Equation Modeling: A Multidisciplinary \nJournal, 6(1), 1–55. https://doi.org/10.1080/ \n10705519909540118\nHubert, M., Florack, A., Gattringer, R., Eberhardt, T., \nEnkel, E., & Kenning, P. (2017). Flag up!–Flagship pro­\nducts as important drivers of perceived brand inno­\nvativeness. Journal of Business Research, 71(1), \n154–163. https://doi.org/10.1016/j.jbusres.2016.09. \n001\nKang, J., Tang, L., & Lee, J. Y. (2015). Self-congruity and \nfunctional congruity in brand loyalty. Journal of \nHospitality & Tourism Research, 39(1), 105–131. \nhttps://doi.org/10.1177/1096348012471377\nKang, M., & Shin, D. H. (2016). The effect of customers’ \nperceived benefits on virtual brand community loy­\nalty. Online Information Review, 40(3), 298–315. \nhttps://doi.org/10.1108/oir-09-2015-0300\nKeller, K. L. (1993). Conceptualizing, measuring, and \nmanaging customer-based brand equity. Journal of \nMarketing, 57(1), 1–22. https://doi.org/10.1177/ \n002224299305700101\nKim, C. K., Han, D., & Park, S. B. (2001). The effect of brand \npersonality and brand identification on brand loyalty: \nApplying the theory of social identification. Japanese \nPsychological Research, 43(4), 195–206. https://doi. \norg/10.1111/1468-5884.00177\nKormos, C., & Gifford, R. (2014). The validity of self-report \nmeasures of proenvironmental behavior: A \nmeta-analytic review. Journal of Environmental \nPsychology, 40(1), 359–371. https://doi.org/10.1016/j. \njenvp.2014.09.003\nKuhl, J., & Beckmann, J. (1985). Historical perspectives in \nthe study of action control. In Action control: From \ncognition to behavior,89–100. https://doi.org/10. \n1007/978-3-642-69746-3_5\nLin, T. C., Huang, S. L., & Hsu, C. J. (2015). A dual-factor \nmodel of loyalty to IT product–The case of smart­\nphones. International Journal of Information \nManagement, 35(2), 215–228. https://doi.org/10. \n1016/j.ijinfomgt.2015.01.001\nLoureiro, S. M. C. (2013). The effect of perceived ben­\nefits, trust, quality, brand awareness/associations \nand brand loyalty on internet banking brand \nequity. International Journal of Electronic \nCommerce Studies, 4(2), 139–158. https://doi.org/ \n10.7903/ijecs.1000\nMartos-Partal, M., & González-Benito, Ó. (2013). Studying \nmotivations of store-loyal buyers across alternative \nmeasures of behavioural loyalty. European \nManagement Journal, 31(4), 348–358. https://doi.org/ \n10.1016/j.emj.2013.01.010\nMcIntyre, D. A., & Frohlich, T. C. (2015). The 10 most \nprofitable companies in the world. 24/7 Wall St. \nAccessed August, 30, 2020 https://247wallst.com/ \nspecial-report/2015/10/27/the-most-profitable- \ncompanies-in-the-world/4\nConsumer Electronics. (2018, July 31). Gartner's Digital IQ \nIndex. https://www.gartner.com/en/marketing/ \nresearch/consumer-electronics–2018\nMimouni-Chaabane, A., & Volle, P. (2010). Perceived ben­\nefits of loyalty programs: Scale development and \nimplications for relational strategies. Journal of \nBusiness Research, 63(1), 32–37. https://doi.org/10. \n1016/j.jbusres.2009.01.008\nMohr, J. J., Sengupta, S., & Slater, S. (2010). Marketing of \nhigh-technology products and innovations (3rd ed.). \nPrentice Hall.\nMorisky, D. E., Ang, A., & Sneed, C. D. (2002). Validating \nthe effects of social desirability on self-reported \ncondom use behaviour among commercial sex \nworkers. AIDS Education and Prevention, 14(5), \n351–360. https://doi.org/10.1521/aeap.14.6.351. \n24078\nMorisky, D. E., Green, L. W., & Levine, D. M. (1986). \nConcurrent and predictive validity of a self-reported \nmeasure of medication adherence. Medical Care, 24 \n(1), 67–74. https://doi.org/10.1097/00005650- \n198601000-00007\nMorris, B. (1996, March). The brand’s the thing not so long \nago. Fortune. https://archive.fortune.com/magazines/ \nfortune/fortune_archive/1996/03/04/210041/index.htm\nVera-Martínez, Cogent Business & Management (2021), 8: 1969632                                                                                                                                  \nhttps://doi.org/10.1080/23311975.2021.1969632                                                                                                                                                       \nPage 13 of 17\nMulyanegara, R. C. (2011). The relationship between \nmarket orientation, brand orientation and perceived \nbenefits in the non-profit sector: A \ncustomer-perceived paradigm. Journal of Strategic \nMarketing, 19(5), 429–441. https://doi.org/10.1080/ \n0965254X.2011.565880\nNikhashemi, S. R., & Valaei, N. (2018). The chain of effects \nfrom brand personality and functional congruity to \nstages of brand loyalty: The moderating role of \ngender. Asia Pacific Journal of Marketing and \nLogistics, 30(1), 84–105. https://doi.org/10.1108/ \nAPJML-01-2017-0016\nOliver, R. L. (1999). Whence consumer loyalty? Journal of \nMarketing, 63(4_suppl1), 33–44. https://doi.org/10. \n1177/00222429990634s105\nOlsen, S. O. (2002). Comparative evaluation and the rela­\ntionship between quality, satisfaction, and repurch­\nase loyalty. Journal of the Academy of Marketing \nScience, 30(3), 240–249. https://doi.org/10.1177/ \n0092070302303005\nPappu, R., & Quester, P. G. (2016). How does brand inno­\nvativeness affect brand loyalty? European Journal of \nMarketing, 50(1/2), 2–28. https://doi.org/10.1108/ \nEJM-01-2014-0020\nPark, C. W., Macinnis, D. J., Priester, J., Eisingerich, A. B., & \nIacobucci, D. (2010). Brand attachment and brand atti­\ntude strength: Conceptual and empirical differentiation \nof two critical brand equity drivers. Journal of Marketing, \n74(6), 1–17. https://doi.org/10.1509/jmkg.74.6.1\nPodsakoff, P. M., MacKenzie, S. B., & Podsakoff, N. P. \n(2012). Sources of method bias in social science \nresearch and recommendations on how to control it. \nAnnual Review of Psychology, 63(1), 539–569. https:// \ndoi.org/10.1146/annurev-psych-120710-100452\nPodsakoff, P. M., Scott, B., MacKenzie, J. Y. L., & \nNathan, P. P. (2003). Common method biases in \nbehavioral research: A critical review of the literature \nand recommended remedies. Journal of Applied \nPsychology, 88(5), 879–903. https://doi.org/10.1037/ \n0021-9010.88.5.879\nPorter, M. E. (1980). Competitive Strategy: Techniques for \nanalyzing industries and competitors. Free Press.\nRather, R. A. (2018). Investigating the impact of customer \nbrand identification on hospitality brand loyalty: \nA social identity perspective. Journal of Hospitality \nMarketing & Management, 27(5), 487–513. https:// \ndoi.org/10.1080/19368623.2018.1404539\nShams, R., Alpert, F., & Brown, M. (2015). Consumer per­\nceived brand innovativeness: Conceptualization and \noperationalization. European Journal of Marketing, 49 \n(9/10), 1589–1615. https://doi.org/10.1108/EJM-05- \n2013-0240\nShams, R., Brown, M., & Alpert, F. (2017). The role of brand \ncredibility in the relationship between brand innova­\ntiveness and purchase intention. Journal of Customer \nBehaviour, 16(2), 145–159. https://doi.org/10.1362/ \n147539217X14909732699534\nSo, K. K. F., King, C., Hudson, S., & Meng, F. (2017). The \nmissing link in building customer brand identification: \nThe role of brand attractiveness. Tourism \nManagement, 59(1), 640–651. https://doi.org/10. \n1016/j.tourman.2016.09.013\nSo, K. K. F., King, C., Sparks, B. A., & Wang, Y. (2013). The \ninfluence of customer brand identification on hotel \nbrand evaluation and loyalty development. \nInternational Journal of Hospitality Management, 34 \n(1), 31–41. https://doi.org/10.1016/j.ijhm.2013.02.002\nStets, J. E., & Burke, P. J. (2000). Identity theory and social \nidentity theory. Social Psychology Quarterly, 63(3), \n224–237. https://doi.org/10.2307/2695870\nStory, V. M., Boso, N., & Cadogan, J. W. (2015). The form of \nrelationship between firm-level product innovative­\nness and new product performance in developed and \nemerging markets. Journal of Product Innovation \nManagement, 32(1), 45–64. https://doi.org/10.1111/ \njpim.12180\nTavakol, M., & Dennick, R. (2011). Making sense of \nCronbach’s alpha. International Journal of Medical \nEducation, 2(1), 53–55. https://doi.org/10.5116/ijme. \n4dfb.8dfd\nTruong, Y., Klink, R. R., Simmons, G., Grinstein, A., & \nPalmer, M. (2017). Branding strategies for \nhigh-technology products: The effects of consumer \nand product innovativeness. Journal of Business \nResearch, 70(1), 85–91. https://doi.org/10.1016/j. \njbusres.2016.07.003\nTuškej, U., Golob, U., & Podnar, K. (2013). The role of \nconsumer–brand identification in building brand \nrelationships. Journal of Business Research, 66(1), \n53–59. https://doi.org/10.1016/j.jbusres.2011.07.022\nVan Osselaer, S. M., & Alba, J. W. (2000). Consumer \nlearning and brand equity. Journal of Consumer \nResearch, 27(1), 1–16. https://doi.org/10.1086/ \n314305\nVera, J., & Trujillo, A. (2017). Searching most influential \nvariables to brand loyalty measurements: An \nexploratory study. Contaduría y Administración, 62 \n(2), 600–624. https://doi.org/10.1016/j.cya.2016. \n04.007\nVölckner, F., & Sattler, H. (2006). Drivers of brand exten­\nsion success. Journal of Marketing, 70(2), 18–34. \nhttps://doi.org/10.1509/jmkg.70.2.018\nWang, Y., Chan, S. F., & Yang, Z. (2013). Customers’ per­\nceived benefits of interacting in a virtual brand \ncommunity in China. Journal of Electronic Commerce \nResearch, 14(1), 49–66. http://www.jecr.org/sites/ \ndefault/files/14_01_p4.pdf\nWard, S., Light, L., & Goldstine, J. (1999). What high-tech \nmanagers need to know about brands. Harvard \nBusiness Review, 77(4), 85. https://hbr.org/1999/07/ \nwhat-high-tech-managers-need-to-know-about- \nbrands\nWheaton, B., Muthen, B., Alwin, D. F., & Summers, G. F. \n(1977). Assessing reliability and stability in panel \nmodels. Sociological Methodology, 8(1), 84–136. \nhttps://doi.org/10.2307/270754\nYeh, C. H., Wang, Y. S., & Yieh, K. (2016). Predicting \nsmartphone brand loyalty: Consumer value and \nconsumer-brand identification perspectives. \nInternational Journal of Information Management, 36 \n(3), 245–257. https://doi.org/10.1016/j.ijinfomgt. \n2015.11.013\nYoo, B., & Donthu, N. (2001). Developing and validating \na multidimensional consumer-based brand equity \nscale. Journal of Business Research, 52(1), 1–14. \nhttps://doi.org/10.1016/S0148-2963(99)00098-3\nZeithaml, V. A., Berry, L. L., & Parasuraman, A. (1996). The \nbehavioral consequences of service quality. Journal \nof Marketing, 60(2), 31–46. https://doi.org/10.1177/ \n002224299606000203\nVera-Martínez, Cogent Business & Management (2021), 8: 1969632                                                                                                                                  \nhttps://doi.org/10.1080/23311975.2021.1969632\nPage 14 of 17\nAppendices \nTable A1. Original items in Spanish\nInnovación percibida\nEsta marca tiene productos muy actuales\nEs una marca con productos novedosos\nEsta marca está a la vanguardia\nBeneficio percibido\nLos productos con esta marca siempre son muy útiles o beneficiosos\nCon esta marca siempre tengo productos que van con mis necesidades\nLos productos de esta marca siempre me sirven\nIdentificación con la marca\nEsta marca me entiende en cuanto a lo que necesito\nCon esta marca me identifico\nEsta marca refleja cosas que me interesan\nLealtad afectiva\nMe gusta mucho esta marca\nPrefiero esta marca que las demás\nEsta marca es una de mis preferidas\nLealtad intencional\nLa próxima vez voy a volver a comprar esta marca\nRecomendaría esta marca\nConsidero esta marca mi primera cuando compro productos de este tipo\nLealtad conductual\nGeneralmente compro esta marca\nLas veces anteriores que compré productos relacionados, elegí esta marca\nEn el pasado siempre he elegido esta marca\nVera-Martínez, Cogent Business & Management (2021), 8: 1969632                                                                                                                                  \nhttps://doi.org/10.1080/23311975.2021.1969632                                                                                                                                                       \nPage 15 of 17\nTable A2. Descriptive results\nSony\nSamsung\nHP\nApple\nx\nσ\nx\nσ\nx\nσ\nx\nσ\nInnovativeness1\n5.74\n1.27\n5.94\n1.39\n5.20\n1.62\n6.56\n.69\nInnovativeness2\n5.51\n1.23\n5,76\n1.47\n4.79\n1.72\n6.53\n.71\nInnovativeness3\n5.51\n1.23\n5.85\n1.43\n4.94\n1.6\n6.45\n.78\nBenefits1\n5.58\n.91\n5.65\n1.29\n5.28\n1.30\n6.05\n1.14\nBenefits2\n5.40\n1.04\n5.56\n1.28\n4.91\n1.34\n6.16\n1.15\nBenefits3\n5.66\n1.07\n5.69\n1.30\n5.16\n1.51\n6.20\n.95\nIdentification1\n5.38\n1.05\n5.36\n1.07\n5.15\n1.34\n6.00\n.98\nIdentification2\n5.08\n1.27\n5.19\n1.47\n4.64\n1.49\n5.75\n1.45\nIdentification3\n5.38\n1.27\n5.53\n1.22\n4.80\n1.66\n6.06\n.95\nAffective1\n4.69\n.85\n5.00\n1.07\n4.49\n.98\n5.49\n.64\nAffective2\n4.38\n1.17\n4.39\n1.11\n3.95\n1.43\n5.30\n1.14\nAffective3\n4.30\n1.12\n4.60\n1.05\n4.26\n1.41\n5.36\n1.03\nIntentions1\n4.63\n1.01\n4.63\n1.06\n4.04\n1.44\n5.38\n.99\nIntentions2\n4.96\n.79\n4.99\n.95\n4.44\n1.24\n5.41\n.72\nIntentions3\n4.35\n1.14\n4.49\n1.09\n4.08\n1.11\n5.28\n1.19\nBehavioral1\n3.63\n.88\n3.20\n1.04\n3.28\n1.07\n3.99\n1.08\nBehavioral2\n3.65\n.89\n3.00\n1.20\n3.44\n1.05\n3.49\n1.34\nBehavioral3\n3.15\n1.21\n2.58\n1.23\n2.99\n1.16\n3.05\n1.36\nVera-Martínez, Cogent Business & Management (2021), 8: 1969632                                                                                                                                  \nhttps://doi.org/10.1080/23311975.2021.1969632\nPage 16 of 17\n© 2021 The Author(s). This open access article is distributed under a Creative Commons Attribution (CC-BY) 4.0 license. \nYou are free to:  \nShare — copy and redistribute the material in any medium or format.  \nAdapt — remix, transform, and build upon the material for any purpose, even commercially.  \nThe licensor cannot revoke these freedoms as long as you follow the license terms.  \nUnder the following terms:  \nAttribution — You must give appropriate credit, provide a link to the license, and indicate if changes were made.  \nYou may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.  \nNo additional restrictions  \nYou may not apply legal terms or technological measures that legally restrict others from doing anything the license permits.\nCogent Business & Management (ISSN: 2331-1975) is published by Cogent OA, part of Taylor & Francis Group.  \nPublishing with Cogent OA ensures:  \n• \nImmediate, universal access to your article on publication  \n• \nHigh visibility and discoverability via the Cogent OA website as well as Taylor & Francis Online  \n• \nDownload and citation statistics for your article  \n• \nRapid online publication  \n• \nInput from, and dialog with, expert editors and editorial boards  \n• \nRetention of full copyright of your article  \n• \nGuaranteed legacy preservation of your article  \n• \nDiscounts and waivers for authors in developing regions  \nSubmit your manuscript to a Cogent OA journal at www.CogentOA.com   \nVera-Martínez, Cogent Business & Management (2021), 8: 1969632                                                                                                                                  \nhttps://doi.org/10.1080/23311975.2021.1969632                                                                                                                                                       \nPage 17 of 17\n", "created_at": "2024-12-01"}
{"doc_id": "sample.eml", "source_type": "email", "title": "test", "body": "Hello world!\n", "created_at": "Sun, 08 Jan 2017 20:37:44 +0200"}
